cf/DataProcessors/ЗагрузкаАссортиментнойМатрицы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаАссортиментнойМатрицы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Матрица</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаФайла</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Матрица</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/InformationRegisters/АссортиментаяМатрица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>АссортиментаяМатрица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Матрица</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/DataProcessors/ЗагрузкаАссортиментнойМатрицы/Forms/Форма/Ext/Form/Module.bsl
///////////////////// На клиенте /////////////////////
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьНачальныеНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНачальныеНастройки()
	
	// Устанавливаем номера колонок по умолчанию
	Объект.Номенклатура	= 1;
	Объект.Поставщик	= 2;
	Объект.Матрица		= 3;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИзExcel(Команда)
	
	Если ЗначениеЗаполнено(Объект.Файл) Тогда
		Если ПроверитьЗаполненияНомеровКолонок() Тогда
			ЗагрузитьИзФайла();
			Если Объект.ТаблицаФайла.Количество() > 0 Тогда
				Состояние("Данные загружены!");
			Иначе
				Состояние("Нет данных для загрузки!");
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран файл!", ,);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполненияНомеровКолонок()
	
	Проверка = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан номер колонки номенклатуры!", ,);
		Проверка = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Поставщик) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан номер колонки поставщика!", ,);
		Проверка = Ложь;
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Объект.Матрица) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан номер колонки матрицы!", ,);
		Проверка = Ложь;
	КонецЕсли;
		
	Возврат Проверка;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьФайл(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогФыбораФайла					= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФыбораФайла.Фильтр			= "Файл данных (*.xls, *.xlsx)|*.xls; *.xlsx";
	ДиалогФыбораФайла.Заголовок			= "Выберите файл";
	
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Объект.Файл = ДиалогФыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	
	Если Объект.ТаблицаФайла.Количество() > 0 Тогда
		
		ЗаписатьДанныеНаСервере();
	
		ПоказатьПредупреждение(, "Данные записаны!");
		
	Иначе
		
		ПоказатьПредупреждение(, "Данные файла отсутствуют!");
		
	КонецЕсли;
	
КонецПроцедуры

///////////////////// На сервере /////////////////////
&НаСервере
Процедура ЗагрузитьИзФайла()
	
	КомОбЭксел = Новый COMОбъект("Excel.Application");
	
	НомерЛиста = 1;
	ТекСтрока = 2;
	
	Попытка
		Book = КомОбЭксел.WorkBooks.Open(Объект.Файл);
		ТекЛист = Book.WorkSheets(НомерЛиста);
	Исключение
		Возврат;
	КонецПопытки;
	
	Объект.ТаблицаФайла.Очистить();
	
	Пока НЕ ПустаяСтрока(СокрЛП(ТекЛист.Cells(ТекСтрока, Объект.ТипОбработки).Value)) Цикл
		 
		НаимНоменклатура = Формат(ТекЛист.Cells(ТекСтрока, Объект.Номенклатура).Value, "ЧГ=0"); 
		НаимПоставщика = Формат(ТекЛист.Cells(ТекСтрока, Объект.Поставщик).Value, "ЧГ=0");
		ЗначМатрица = Формат(ТекЛист.Cells(ТекСтрока, Объект.Матрица).Value, "ЧГ=0"); 
		
		Если ЗначениеЗаполнено(НаимНоменклатура) Тогда
			
			НоваяСтрока = Объект.ТаблицаФайла.Добавить();
			НоваяСтрока.Номенклатура	= Справочники.Номенклатура.НайтиПоНаименованию(НаимНоменклатура);
			НоваяСтрока.Поставщик		= Справочники.Контрагенты.НайтиПоНаименованию(НаимПоставщика);
			НоваяСтрока.Матрица			= ЗначМатрица;
			
		КонецЕсли;
		
		ТекСтрока = ТекСтрока + 1;
		
	КонецЦикла;
	
	Book.Close(0);
	КомОбЭксел.Quit();
	КомОбЭксел = Неопределено;
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеНаСервере()
	
	НабЗап = РегистрыСведений.АссортиментаяМатрица.СоздатьНаборЗаписей();
	НабЗап.Записать();
	
	Для Каждого Стр из Объект.ТаблицаФайла Цикл
		
		Зап = НабЗап.Добавить();
		ЗаполнитьЗначенияСвойств(Зап, Стр);
		
		Зап.Автор = ПараметрыСеанса.ТекущийПользователь;
		Зап.ДатаЗаписи = ТекущаяДата();
		
	КонецЦикла;
	
	НабЗап.Записать();	
	
КонецПроцедуры
